##### Sometimes ,we get a dataset which has columns which contains mix data i.e numerical data and categorical data.To handle this dataset , is tough task.

##### The idea is to convert the categorical and numerical part into two different columns.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')

In [3]:
df.head(10)

  Cabin            Ticket number  Survived
0   NaN         A/5 21171      5         0
1   C85          PC 17599      3         1
2   NaN  STON/O2. 3101282      6         1
3  C123            113803      3         1
4   NaN            373450      A         0
5   NaN            330877      2         0
6   E46             17463      2         0
7   NaN            349909      5         0
8   NaN            347742      1         1
9   NaN            237736      A         1